/* Errors returned by the device in the form of xml */
"Success" = "Correcto";
"TestInProgress" = "Se están realizando las pruebas... Espere.";
"ErrorDeviceBusy" = "El dispositivo está ocupado. Inténtelo de nuevo más tarde.";
"ErrorDuplicateDisplayName" = "Nombre de visualización o de ubicación repetido. Asigne un nombre diferente y vuelva a intentarlo.";
"ErrorEmptyEntry" = "Una de las entradas de la configuración enviada al dispositivo está vacía. Compruebe que todas las entradas son válidas e inténtelo de nuevo.";
"ErrorListFull" = "No hay espacio disponible para añadir esta entrada. Elimine una entrada del dispositivo e inténtelo de nuevo.";
"ErrorSettingNotTested" = "Este parámetro no se ha probado.";
"ErrorSystemFailure" = "Se ha producido un fallo crítico. Inténtelo de nuevo más tarde.";
"ErrorNoMoreSpace" = "El tamaño máximo de adjunto de correo electrónico es demasiado grande para el servidor seleccionado. Introduzca un valor más bajo y vuélvalo a intentar.";
"ErrorNoWritePermission" = "La carpeta que ha seleccionado no tiene permiso de escritura. Establezca los derechos de acceso correctos para la carpeta y vuélvalo a intentar.";
"ErrorConnectionFailed" = "El dispositivo no se puede conectar al servidor remoto especificado.";
"ErrorConnectionRefused" = "El servidor ha rechazado la conexión. Compruebe que el servidor está encendido y en funcionamiento.";
"ErrorServerNotFound" = "El dispositivo no puede resolver el nombre de host del servidor. Compruebe la configuración del servidor.";
"ErrorWrongCredentials" = "El servidor ha rechazado los datos de usuario usados para la autenticación. Introduzca los datos correctos y vuélvalo a intentar.";
"ErrorConnectionProblem" = "Ha habido un problema con la conexión con el servidor remoto. Compruebe que el servidor se encuentra conectado a la red y en funcionamiento.";
"ErrorProtocolNotSupported" = "El servidor remoto utiliza un protocolo no admitido.";
"ErrorInvalidFileOrDirectory" = "La ruta que ha especificado no es válida. Especifique una ruta válida e inténtelo de nuevo.";
"ErrorInvalidFolderPath" = "La ruta que ha especificado no es válida. Especifique una ruta válida e inténtelo de nuevo.";
"ErrorInvalidShare" = "La carpeta compartida no es válida. Seleccione una carpeta compartida distinta e inténtelo de nuevo.";
"ErrorAuthenticationNeeded" = "El servidor especificado requiere autenticación. Introduzca los datos correctos para acceder al servidor e inténtelo de nuevo.";
"ErrorSecureConnectionNotSupported" = "El servidor no admite las conexiones con seguridad SSL. Desmarque la casilla Utilizar SSL e inténtelo de nuevo.";
"ErrorSenderInvalid" = "La dirección de correo electrónico del remitente no es válida. Introduzca una dirección de remitente correcta e inténtelo de nuevo.";
"ErrorRecipientInvalid" = "La dirección de correo electrónico del destinatario no es válida. Introduzca una dirección de correo electrónico válida e inténtelo de nuevo.";
"ErrorServerError" = "El servidor ha devuelto un error. La operación solicitada no se puede llevar a cabo. Compruebe que los datos relativos al servidor que ha introducido sean correctos.";
"ErrorInvalidServerName" = "El servidor especificado no es válido. Introduzca un servidor SMTP válido e inténtelo de nuevo.";

"404 Not Found" = "No se puede encontrar el dispositivo. Compruebe que el dispositivo se encuentre conectado a la red y encendido.";
"400 Bad Request" = "No se puede procesar la solicitud debido a que contiene un error. Inténtelo de nuevo más tarde.";

//error if the seed URL could not be obtained from the device
"COULD_NOT_GET_ACTUAL_URL" = "El dispositivo no ha devuelto una URL válida. Espere unos minutos e inténtelo de nuevo.";

/* XML Data validation errors */
"Setting Error" = "Error debido a que faltan datos o que los datos son incorrectos";
"MISSING_FOLDER_SETTING" = "Faltan datos de destino de carpeta. Seleccione una carpeta, introduzca el nombre y contraseña e inténtelo de nuevo.";
"MISSING_EMAIL_SETTING" = "Faltan datos del destino de la dirección de correo electrónico. Introduzca todos los parámetros de correo electrónico e inténtelo de nuevo.";
"MISSING_SERVER_CREDENTIALS" = "Faltan los datos del servidor. Introduzca el nombre de usuario y contraseña e inténtelo de nuevo.";
"MISSING_DISPLAY_NAME" = "Falta el nombre del remitente. Introdúzcalo y vuelva a intentarlo.";
"MISSING_EMAIL_ADDRESS" = "Falta la dirección de correo electrónico. Introduzca una dirección de correo electrónico válida e inténtelo de nuevo.";
"MISSING_SERVER" = "Falta el servidor. Introduzca un servidor e inténtelo de nuevo.";

"INVALID_PIN" = "El PIN que ha introducido no es válido. El número debe tener exactamente 4 dígitos Introduzca un PIN válido e inténtelo de nuevo.";
"INVALID_SERVER_PORT" = "El número de puerto del servidor que ha introducido no es válido. El número de puerto debe estar comprendido entre 1 y 65535.";
"INVALID_ATTMT_SIZE" = "El tamaño máximo de archivo adjunto que ha introducido no es válido. El número debe estar comprendido entre 1 y 9999. Especifique -1 para que el parámetro de tamaño de adjunto se configure automáticamente.";
"INVALID_DFADESTINATION" = "El destino de fax digital que ha seleccionado no es válido. Seleccione una destinación correcta.";
"INVALID_POLLING_TIME" = "El intervalo de sondeo que ha seleccionado no es válido. Los valores válidos son 5, 10, 15, 20, 30, 45 y 60. Seleccione un intervalo adecuado e inténtelo de nuevo.";
"INVALID_DISPLAY_NAME" = "El nombre de remitente que ha introducido no es válido. Introduzca un nombre de remitente de menos de 25 caracteres.";

/* Other errors */
"GENERIC_ERROR_TITLE" = "Error";
"GENERIC_DEVICE_ERROR_TITLE" = "Error del dispositivo";
"GENERIC_DEVICE_ERROR_DESC" = "Se ha producido un error desconocido al comunicarse con el dispositivo. Inténtelo de nuevo más tarde.";
"XML_PARSING_ERROR" = "El dispositivo ha devuelto datos no válidos. Espere unos minutos y después vuélvalo a intentar.";
"DEVICE_COMMUNICATION_ERROR_DESC" = "Ha habido un error al comunicarse con el dispositivo. Compruebe que el dispositivo y su máquina están conectados a la red y vuélvalo a intentar.";

/* Buttons */
"OK" = "OK";
"Cancel" = "Cancelar";
"Hide" = "Ocultar";

/*vhm: Added PML Related Errors*/

"DEVICE_NOT_FOUND_TITLE" = "No se ha encontrado el dispositivo";
"DEVICE_NOT_FOUND_DESC" = "Ha habido un error al comunicarse con el dispositivo. Asegúrese de que el dispositivo esté encendido y conectado correctamente y vuélvalo a intentar.";

"PML_ERROR_TITLE" = "Error del dispositivo";
"PML_ERROR_DESC1" = "Ha habido un error al configurar la información del dispositivo. Asegúrese de que los valores de entrada sean válidos.";

"SETTING_REJECTED_TITLE" = "No se acepta esta configuración";

"SETTING_REJECTED_DESCRIPTION" = "No se ha podido llevar a cabo la instalación porque el dispositivo está protegido por contraseña administrativa. Utilice el Servidor web integrado para quitar la contraseña administrativa. Consulte la documentación de su dispositivo para obtener más información.";
"GENERAL_DATA_MISSING_DESCRIPTION" = "Uno o más campos no contienen datos. Complete todos los campos o haga clic en Cancelar.";


//Device Door open error while printing the fax logs
"DOOR_OPEN_TITLE" = "Puerta/tapa abierta";
"DOOR_OPEN_DESC" = "La impresora no puede imprimir porque la tapa está abierta. Cierre todas las tapas de la impresora.";


//Device not ready error while printing the fax logs
"INCORRECT_STATE_TITLE" = "La impresora tiene un estado de error";
"INCORRECT_STATE_DESC" = "Resuelva la situación de error del dispositivo e inténtelo de nuevo.";

//Device busy error while printing the fax logs
"DEVICE_BUSY_TITLE" = "La impresora está actualmente ocupada";
"DEVICE_BUSY_DESC" = "Espere hasta que la impresora finalice el trabajo actual.";

//Error if the device's region code does not support fax blocking
"CALLER_ID_NOT_SUPPORTED_TITLE" = "ID de persona que llama no admitido";
"CALLER_ID_NOT_SUPPORTED_DESC" = "El País/Región actualmente definido en el dispostivo no admite el ID de la persona que llama. Utilice el panel frontal del dispositivo para seleccionar el País/Región qe admite el ID de la persona que llama e inténtelo de nuevo.";

//Error if black list entries are applied while device is processing the fax job
"COULD_NOT_APPLY_SETTINGS_TITLE" = "No se pudieron aplicar los ajustes.";
"COULD_NOT_APPLY_SETTINGS_DESC" = "Compruebe que el dispositivo esté en línea y no está procesando un trabajo de fax.";


